# 다음 퀴즈를 수행하시오.

### Q1. pandas 모듈을 pd로 불러오시오.

In [1]:
import pandas as pd

### Q2. "bike_rental.csv"와 "bike_weather.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오.
(불러온 파일을 각각 rental, weather 객체에 저장하시오.)

In [2]:
rental = pd.read_csv("DS_lv1/bike_rental.csv")
type(rental)

pandas.core.frame.DataFrame

In [3]:
weather = pd.read_csv("DS_lv1/bike_weather.csv")
type(weather)

pandas.core.frame.DataFrame

### Q3. rental과 weather 객체의 첫 5개 row를 출력하시오.

In [5]:
rental.head(5)

              datetime  casual  registered  count
0  2011-01-01 00:00:00       3          13     16
1  2011-01-01 01:00:00       8          32     40
2  2011-01-01 02:00:00       5          27     32
3  2011-01-01 03:00:00       3          10     13
4  2011-01-01 04:00:00       0           1      1

In [6]:
weather.head(5)

,date,hour,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
0,2011-01-01,0,1,0,0,1,9.84,14.395,81,0.0
1,2011-01-01,1,1,0,0,1,9.02,13.635,80,0.0
2,2011-01-01,2,1,0,0,1,9.02,13.635,80,0.0
3,2011-01-01,3,1,0,0,1,9.84,14.395,75,0.0
4,2011-01-01,4,1,0,0,1,9.84,14.395,75,0.0

### Q4. casual 변수와 registered 변수의 합이 count변수의 합과 같다는 것을 증명하시오.

In [21]:
#정답
(rental["casual"] + rental["registered"] == rental["count"]).sum() == len(rental)
sum(rental["casual"] + rental["registered"] == rental["count"]) == len(rental)

#허점있는 오답
#(rental["casual"] + rental["registered"] - rental["count"] == 0).sum()
#sum(rental["casual"] + rental["registered"] - rental["count"] == 0)

True

### Q5. weather 객체에 rental 객체를 column 기준으로 concat() 함수를 활용하여 병합하시오.
(데이터를 병합하여 df_con 객체에 저장하시오.)

In [22]:
df_con = pd.concat([rental, weather], axis = 1)
df_con.head(2)

,datetime,casual,registered,count,date,hour,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
0,2011-01-01 00:00:00,3,13,16,2011-01-01,0,1,0,0,1,9.84,14.395,81,0.0
1,2011-01-01 01:00:00,8,32,40,2011-01-01,1,1,0,0,1,9.02,13.635,80,0.0

### Q6. df_con 객체의 변수별 결측치 개수를 확인하시오.

In [23]:
df_con.isna().sum().reset_index()

         index  0
0     datetime  0
1       casual  0
2   registered  0
3        count  0
4         date  0
5         hour  0
6       season  0
7      holiday  0
8   workingday  0
9      weather  0
10        temp  0
11       atemp  0
12    humidity  0
13   windspeed  0

### Q7. pandas.DataFrame의 merge() 을 활용하여 weather과 rental 데이터를 병합하시오.
(병합한 데이터는 df_join에 저장하시오)
 * rental 객체의 datetime 변수에서 날짜와 시간을 추출하여 weather와 병합하시오.

In [24]:
rental.head(2)

              datetime  casual  registered  count
0  2011-01-01 00:00:00       3          13     16
1  2011-01-01 01:00:00       8          32     40

1. rental 객체의 datetime 변수를 시간 속성으로 변환하였다.
2. datetime 객체로부터 시간 정보를 추출하였다. 
3. datetime 객체로부터 날짜 정보를 추출하였다. 
4. rental 객체와 weather 객체를 병합하였다.

In [27]:
rental["datetime"] = pd.to_datetime(rental["datetime"])
rental["date"] = rental["datetime"].dt.date
rental["hour"] = rental["datetime"].dt.hour
rental.head(2)

             datetime  casual  registered  count        date  hour
0 2011-01-01 00:00:00       3          13     16  2011-01-01     0
1 2011-01-01 01:00:00       8          32     40  2011-01-01     1

In [30]:
rental["date"] = rental["date"].astype("str")

In [32]:
df_join = weather.merge(rental,
                        left_on=["date", "hour"],
                        right_on = ["date", "hour"],
                        how = "left")
df_join.head(2)

,date,hour,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,datetime,casual,registered,count
0,2011-01-01,0,1,0,0,1,9.84,14.395,81,0.0,2011-01-01 00:00:00,3,13,16
1,2011-01-01,1,1,0,0,1,9.02,13.635,80,0.0,2011-01-01 01:00:00,8,32,40

In [33]:
rental2 = pd.read_csv("DS_lv1/bike_rental.csv")
rental2.head(2)

              datetime  casual  registered  count
0  2011-01-01 00:00:00       3          13     16
1  2011-01-01 01:00:00       8          32     40

In [35]:
rental2["date"] = rental2["datetime"].str.slice(0, 10)
rental2["hour"] = rental2["datetime"].str.slice(11, 13).astype("int")
rental2.head(1)

              datetime  casual  registered  count        date  hour
0  2011-01-01 00:00:00       3          13     16  2011-01-01     0

### Q8. df_join의 변수별 결측치를 확인하시오.

In [36]:
df_join.isna().sum().reset_index()

         index  0
0         date  0
1         hour  0
2       season  0
3      holiday  0
4   workingday  0
5      weather  0
6         temp  0
7        atemp  0
8     humidity  0
9    windspeed  0
10    datetime  0
11      casual  0
12  registered  0
13       count  0

### Q9. 정기권 이용자의 자전거 대여[registered] 총합이 가장 많은 계절[season]은 언제인가?
(1: 봄, 2: 여름, 3: 가을, 4: 겨울)
 * df_join 객체 기준으로 풀이하시오

In [37]:
df_join.groupby("season")["registered"].max().reset_index()

   season  registered
0       1         681
1       2         782
2       3         886
3       4         857